BuiDoanAnhKhoa/esp32s3-tinyml-fall-detector/sdkconfig.defaults
# ESP32-S3 N16R8 project defaults; ESP-IDF generates sdkconfig from these.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_I2C_MASTER_SDA=8
CONFIG_I2C_MASTER_SCL=9
CONFIG_I2C_MASTER_FREQUENCY=400000
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU0=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=460800
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
# GPIO48 is provisional until the exact board/revision is confirmed.
CONFIG_FALL_RGB_GPIO=48
CONFIG_FALL_RGB_BRIGHTNESS=64
CONFIG_FALL_MODEL_ARENA_KB=96
CONFIG_FALL_MODEL_ARENA_INTERNAL=y
# Enable detailed timings temporarily when benchmarking on the board.
# CONFIG_FALL_MODEL_PROFILE is not set
# INT8 kernels use ESP-NN's optimized ESP32-S3 implementations.
CONFIG_NN_OPTIMIZED=y
# CONFIG_NN_SKIP_NUDGE is not set
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FALL_SLEEP_BUTTON_GPIO=0
# WiFi station credentials — change these to your network.
CONFIG_FALL_WIFI_SSID="yourssid"
CONFIG_FALL_WIFI_PASSWORD="yourpassword"
# MQTT broker — set to your PC's local IP (run: hostname -I).
CONFIG_FALL_MQTT_BROKER_IP="yourIP"
CONFIG_FALL_MQTT_BROKER_PORT=1883
# Larger main task stack for WiFi/MQTT initialization.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
